{"name":"Ashar","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Ashar Rahman,","headerTaglineThree":"Fullstack Developer","headerTaglineFour":" based in Rochester, NY","showCursor":true,"showBlhttps://firebasestorage.googleapis.com/v0/b/ashar-rahman.appspot.com/o/Screenshot%202023-11-29%20at%209.06.45%E2%80%AFPM.png?alt=media&token=30b749e2-5aa6-44e6-875a-0f4a3ee97c35localog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/icon2341"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/ashar-rahman/"},{"id":"3","title":"Twitter","link":"https://twitter.com/realAsharRahman"},{"id":"4","title":"Blog","link":"https://medium.com/@asharrahman2002"},{"id":"5","title":"Email","link":"mailto:asharrahman02@gmail.com"}],"projects":[{"id":"2","title":"Sheska","description":"Sheska is an online fintech platform that makes hosting events easier, more integrated, and cheaper. It hosts seamless guest integration experiences that allow guests to learn about, fund, and experience your event in a one-of-a-kind way. It also allows customers to find vendors on the platform who meet their needs, it handles payments, vendor integrations, and more. Built in React, TailwindCSS, on Serverless Google Cloud Infastructure","imageSrc":"https://dev.sheska.co/static/media/peopleHavingFun.61e06fb8f4ff79806f47.jpg","url":"https://dev.sheska.co/"},{"id":"3","title":"Local","description":"Local makes it easier to find things to do. Built in React native with Expo on both IOS and Android","imageSrc":"https://firebasestorage.googleapis.com/v0/b/ashar-rahman.appspot.com/o/Screenshot%202023-11-29%20at%209.06.45%E2%80%AFPM.png?alt=media&token=30b749e2-5aa6-44e6-875a-0f4a3ee97c35","url":""}],"services":[{"id":"1","title":"Art Direction","description":"We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."},{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"Computer science professional Interested in building things that make people delighted. ","resume":{"tagline":"👋  I am a Fullstack engineer.","description":"Well-versed with React, Javascript, and most of the Web frameworks. Passionate about building scalable, maintainable, and viral experiences.","experiences":[{"id":"1","dates":"January 2022 - August 2022","type":"Co-Op","position":"Software Engineer at Toast","bullets":"Spearheaded the development of a database script on AWS in Kotlin and PostgresSQL that altered low-quality production user data to become compliant with ISO standards; This applied to 71,000 entities., Designed and presented a policy framework for developing and applying bulk data change scripts to senior leadership to meet Toast’s changing compliance/security standards., Developed anti-fraud tooling, automated triggers, and unit/integration tests to handle fraudulent bank accounts that eliminated the need for manual account suspensions and alerted fraud teams."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"August 2021 - December 2021","type":"Part Time","position":"Undergraduate Researcher at RIT CLASP Lab","bullets":"Implemented multimodal machine learning models to cluster text, facial, and acoustic data sets., Studied and analyzed the various unsupervised learning models and compared their functions., Incorporated various data mining methods to pre-process and utilize nonuniform data.,Wrote a technical paper on the nuances of the implementations for the various models in the context of detecting confusion in humans."}],"education":{"universityName":"Rochester Institute of Technology","universityDate":"2020-2024","universityPara":"3.7 GPA, with Deans list and Honors. BS in Computer Science"},"languages":["Javascript","HTML5","CSS","Python","TypeScript","C","Java","C#"],"frameworks":["React","NodeJs","Astro","Flask"],"others":["Figma","AdobeXD","AWS"]}}